In [5]:
import numpy as np
import pandas as pd
df = pd.DataFrame({'key1': ['a', 'a', 'b', 'b', 'a'], 'key2' : ['one', 'two', 'one', 'two', 'one'], 'data1': np.random.randn(5), 'data2': np.random.randn(5)})

In [6]:
df

      data1     data2 key1 key2
0 -1.322844  0.413296    a  one
1 -2.060690  0.139050    a  two
2  1.075825 -0.953217    b  one
3 -1.352866 -0.186950    b  two
4  1.862755 -1.024664    a  one

In [7]:
# compute the mean of data1 column by key1

In [8]:
grouped = df['data1'].groupby(df['key1'])

In [9]:
grouped

In [11]:
grouped.mean()

key1
a   -0.506926
b   -0.138521
Name: data1, dtype: float64

In [12]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [13]:
means

key1  key2
a     one     0.269956
      two    -2.060690
b     one     1.075825
      two    -1.352866
Name: data1, dtype: float64

In [14]:
means.unstack()

key2       one       two
key1
a     0.269956 -2.060690
b     1.075825 -1.352866

In [15]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', "Ohio"])
years = np.array([2005, 2005, 2006, 2005, 2006])

In [16]:
df['data1'].groupby([states, years]).mean()

California  2005   -2.060690
            2006    1.075825
Ohio        2005   -1.337855
            2006    1.862755
Name: data1, dtype: float64

In [17]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.506926 -0.157439
b    -0.138521 -0.570083

In [18]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   0.269956 -0.305684
     two  -2.060690  0.139050
b    one   1.075825 -0.953217
     two  -1.352866 -0.186950

In [19]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [20]:
list(df.groupby('key1'))

[('a',       data1     data2 key1 key2
  0 -1.322844  0.413296    a  one
  1 -2.060690  0.139050    a  two
  4  1.862755 -1.024664    a  one), ('b',       data1     data2 key1 key2
  2  1.075825 -0.953217    b  one
  3 -1.352866 -0.186950    b  two)]

In [21]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0 -1.322844  0.413296    a  one
1 -2.060690  0.139050    a  two
4  1.862755 -1.024664    a  one
b
      data1     data2 key1 key2
2  1.075825 -0.953217    b  one
3 -1.352866 -0.186950    b  two

In [22]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
      data1     data2 key1 key2
0 -1.322844  0.413296    a  one
4  1.862755 -1.024664    a  one
('a', 'two')
     data1    data2 key1 key2
1 -2.06069  0.13905    a  two
('b', 'one')
      data1     data2 key1 key2
2  1.075825 -0.953217    b  one
('b', 'two')
      data1    data2 key1 key2
3 -1.352866 -0.18695    b  two

In [23]:
pieces = dict(list(df.groupby('key1')))

In [24]:
pieces['b']

      data1     data2 key1 key2
2  1.075825 -0.953217    b  one
3 -1.352866 -0.186950    b  two

In [25]:
pieces['a']

      data1     data2 key1 key2
0 -1.322844  0.413296    a  one
1 -2.060690  0.139050    a  two
4  1.862755 -1.024664    a  one

In [26]:
df

      data1     data2 key1 key2
0 -1.322844  0.413296    a  one
1 -2.060690  0.139050    a  two
2  1.075825 -0.953217    b  one
3 -1.352866 -0.186950    b  two
4  1.862755 -1.024664    a  one

In [27]:
grouped = df.groupby(df.dtypes, axis = 1)

In [28]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -1.322844  0.413296
1 -2.060690  0.139050
2  1.075825 -0.953217
3 -1.352866 -0.186950
4  1.862755 -1.024664
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [29]:
df

      data1     data2 key1 key2
0 -1.322844  0.413296    a  one
1 -2.060690  0.139050    a  two
2  1.075825 -0.953217    b  one
3 -1.352866 -0.186950    b  two
4  1.862755 -1.024664    a  one

In [30]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.305684
     two   0.139050
b    one  -0.953217
     two  -0.186950

In [31]:
# the previous statement is the same as
df[['data2']].groupby([df['key1'], df['key2']]).mean()

              data2
key1 key2
a    one  -0.305684
     two   0.139050
b    one  -0.953217
     two  -0.186950

In [32]:
people = pd.DataFrame(np.random.randn(5,5), columns = ['a', 'b', 'c', 'd', 'e'], index = ['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [33]:
people

               a         b         c         d         e
Joe    -1.668304 -2.349227 -1.418285  1.277833 -1.257970
Steve   1.524833  1.479759 -0.062282 -1.552233  1.018531
Wes     0.780268 -1.023313  0.056847 -0.024851  2.086350
Jim    -2.128408  0.342841 -0.380055  1.824853 -1.074599
Travis -1.466818  0.951093 -0.256868 -0.060491 -0.069085

In [34]:
people.iloc[2, [1,2]] = np.nan

In [35]:
people

               a         b         c         d         e
Joe    -1.668304 -2.349227 -1.418285  1.277833 -1.257970
Steve   1.524833  1.479759 -0.062282 -1.552233  1.018531
Wes     0.780268       NaN       NaN -0.024851  2.086350
Jim    -2.128408  0.342841 -0.380055  1.824853 -1.074599
Travis -1.466818  0.951093 -0.256868 -0.060491 -0.069085

In [36]:
# group people DataFrame by column
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [37]:
by_column = people.groupby(mapping, axis=1)

In [38]:
by_column.sum()

            blue       red
Joe    -0.140452 -5.275501
Steve  -1.614516  4.023123
Wes    -0.024851  2.866619
Jim     1.444797 -2.860166
Travis -0.317359 -0.584809

In [39]:
map_series = pd.Series(mapping)

In [40]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [41]:
people.groupby(mapping, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [42]:
# group people DataFrame by the length of the names
people.groupby(len).sum()

          a         b         c         d         e
3 -3.016444 -2.006386 -1.798340  3.077834 -0.246219
5  1.524833  1.479759 -0.062282 -1.552233  1.018531
6 -1.466818  0.951093 -0.256868 -0.060491 -0.069085

In [43]:
# group people DataFrame by a specific list and lemgth of names
key_list = ['one', 'one', 'one', 'two', 'two']
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -1.668304 -2.349227 -1.418285 -0.024851 -1.257970
  two -2.128408  0.342841 -0.380055  1.824853 -1.074599
5 one  1.524833  1.479759 -0.062282 -1.552233  1.018531
6 two -1.466818  0.951093 -0.256868 -0.060491 -0.069085

In [44]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'], [1,3,5,1,3]], names = ['cty', 'tenor'])

In [45]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [46]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.711380 -0.779370 -0.494936 -0.571789 -1.095578
1     -0.184542 -1.337823  0.634227 -0.085417  0.822962
2      1.247201 -0.076017  0.404203  0.330082 -0.457348
3      2.257720 -0.391068 -0.699706 -0.545660  0.932877

In [47]:
# group DataFram by column
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [48]:
hier_df.groupby(level='tenor', axis = 1).count()

tenor  1  3  5
0      2  2  1
1      2  2  1
2      2  2  1
3      2  2  1

In [49]:
df

      data1     data2 key1 key2
0 -1.322844  0.413296    a  one
1 -2.060690  0.139050    a  two
2  1.075825 -0.953217    b  one
3 -1.352866 -0.186950    b  two
4  1.862755 -1.024664    a  one

In [50]:
grouped = df.groupby('key1')

In [51]:
# getting the 90 percent quantile of data1 by key1
grouped['data1'].quantile(0.9)

key1
a    1.225635
b    0.832956
Name: data1, dtype: float64

In [52]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [53]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     3.923446  1.437960
b     2.428691  0.766266

In [54]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.506926  2.085101 -2.060690 -1.691767 -1.322844  0.269956
b      2.0 -0.138521  1.717344 -1.352866 -0.745693 -0.138521  0.468652

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.862755   3.0 -0.157439  0.763454 -1.024664 -0.442807  0.139050
b     1.075825   2.0 -0.570083  0.541832 -0.953217 -0.761650 -0.570083


           75%       max
key1
a     0.276173  0.413296
b    -0.378517 -0.186950

In [101]:
# Column-Wise and Multiple Function Application

In [56]:
# find the tips percentage of tips between different days with smoker table and non-smoker table
tips = pd.read_csv('tips.csv')

In [57]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [58]:
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [59]:
grouped_tips = tips.groupby(['day', 'smoker'])

In [60]:
grouped_pct = grouped_tips['tip_pct']

In [61]:
tips_mean = grouped_pct.agg('mean')

In [62]:
tips_mean.max()

0.18725031625235425

In [63]:
# find the maximum average tip's conditions
for key, value in dict(tips_mean).items():
    if value == tips_mean.max():
        print(key)

('Sun', 'Yes')

In [144]:
# find the minimum average tip's comditions
for key, value in dict(tips_mean).items():
    if value == tips_mean.min():
        print(key)

('Sat', 'Yes')

In [64]:
tips_mean

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [65]:
# passing a list of argument to agg
grouped_pct.agg(['mean', 'std', peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [66]:
# passing tuples in a list to the agg function, the first element of each tuple serve as the name of the column.
grouped_pct.agg([('foo', 'mean'), ('bar', 'std')])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389